<a href="https://colab.research.google.com/github/prithvikolla/Kaggle-challenges/blob/master/Netflix_Prize_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# EXPLORATORY DATA ANALYSIS
# DATA CLEANING
# DATA MAPPING
# DATA VISUALIZATION

We import pandas library to do exploratory data analysis and visualization

In [0]:
import pandas as pd

Since the file "movie_titles.csv" does not contain any column names i had to give it manually. and we should use encoding = "ISO-8859-1" to read the csv file or else we encounter error.

In [0]:
columnNames = ['YEAR','MOVIE']
MT = pd.read_csv("/content/movie_titles.csv",names= columnNames,encoding = "ISO-8859-1")

In order to observe the first 20 records of the file "movie_titles.csv" we use head() function

In [0]:
MT.head(20)

      YEAR                                              MOVIE
1   2003.0                                    Dinosaur Planet
2   2004.0                         Isle of Man TT 2004 Review
3   1997.0                                          Character
4   1994.0                       Paula Abdul's Get Up & Dance
5   2004.0                           The Rise and Fall of ECW
6   1997.0                                               Sick
7   1992.0                                              8 Man
8   2004.0                         What the #$*! Do We Know!?
9   1991.0                           Class of Nuke 'Em High 2
10  2001.0                                            Fighter
11  1999.0                     Full Frame: Documentary Shorts
12  1947.0                               My Favorite Brunette
13  2003.0  Lord of the Rings: The Return of the King: Ext...
14  1982.0                                 Nature: Antarctica
15  1988.0                   Neil Diamond: Greatest Hits Live
16  1996.0                                          Screamers
17  2005.0                                          7 Seconds
18  1994.0                                   Immortal Beloved
19  2000.0                              By Dawn's Early Light
20  1972.0                                    Seeta Aur Geeta

As we can observe that YEAR column has values in FLOAT , lets try to convert it into integer.
Now,find the number of null values present in each column.

In [0]:
MT.isnull().sum()

YEAR     7
MOVIE    0
dtype: int64

Now, we found that column YEAR has 7 null values and now we have to find those movies which has null years and fill them

In [0]:
MT[pd.isnull(MT).any(axis=1)]

       YEAR                                        MOVIE
4388    NaN      Ancient Civilizations: Rome and Pompeii
4794    NaN  Ancient Civilizations: Land of the Pharaohs
7241    NaN     Ancient Civilizations: Athens and Greece
10782   NaN                       Roti Kapada Aur Makaan
15918   NaN                      Hote Hote Pyaar Ho Gaya
16678   NaN                              Jimmy Hollywood
17667   NaN                           Eros Dance Dhamaka

1.   Ancient Civilizations: Rome and Pompeii - 2001
2.   Ancient Civilizations: Land of the Pharaohs - 2001
3.   Ancient Civilizations: Athens and Greece - 2001
4.   Roti Kapada Aur Makaan - 1974
5.   Hote Hote Pyaar Ho Gaya - 1999
6.   Jimmy Hollywood -1994   
7.   Eros Dance Dhamaka -1999

Now, fill accordingly in the year column to their movies.

In [0]:
MT.at[4388,'YEAR'] = 2001
MT.at[4794,'YEAR'] = 2001
MT.at[7241,'YEAR'] = 2001
MT.at[10782,'YEAR'] = 1974
MT.at[15918,'YEAR'] = 1999
MT.at[16678,'YEAR'] = 1994
MT.at[17667,'YEAR'] = 1999

Now, lets find if there are any null values left in the data frame.

In [0]:
MT.isnull().sum()

YEAR     0
MOVIE    0
dtype: int64

Yay!! No null values were found . 

1.   lets convert the YEAR column to Integer from FLOAT.

In [0]:
MT['YEAR'] = MT['YEAR'].astype(int)

YAY!! we successfully converted the YEAR column to integers.

1.   Lets verify by displaying the dataframe .

In [0]:
MT.head(5)

   YEAR                         MOVIE
1  2003               Dinosaur Planet
2  2004    Isle of Man TT 2004 Review
3  1997                     Character
4  1994  Paula Abdul's Get Up & Dance
5  2004      The Rise and Fall of ECW